{
"status": "success",
"totalResults": 2917,
"results": [
  {
    "article_id": "711992b711b603dbbbc64b306463a615",
    "title": "Hulu Celebrates 25 Years Of ‘Felicity’",
    "link": "https://www.forbes.com/sites/marcberman1/2023/10/02/hulu-celebrates-25-years-of-felicity/",
    "keywords": [
      "Hollywood & Entertainment",
      "/hollywood-entertainment",
      "Business",
      "/business",
      "Hollywood & Entertainment",
      "/hollywood-entertainment",
      "business",
      "Hollywood & Entertainment",
      "standard"
    ],
    "creator": [
      "Marc Berman, Senior Contributor"
    ],
    "video_url": null,
    "description": "If you are of a certain age, you will certainly recall drama Felicity from J.J. Abrams (Alias, Lost).",
    "content": "Forbes Business Hollywood & Entertainment Hulu Celebrates 25 Years Of ‘Felicity’ Marc Berman Senior Contributor Opinions expressed by Forbes Contributors are their own. My beat is network and cable television, digital and syndication. Following Oct 2, 2023, 07:06pm EDT | Share to Facebook Share to Twitter Share to Linkedin 370100 02: Keri Russell stars in Warner Brothers drama \"Felicity.\" (Photo by Frank Ockenfels/Online ... [+] USA) Getty Images If you are of a certain age, you will likely recall drama Felicity from J.J. Abrams ( Alias , Lost ) and Matt Reeves. It starred Keri Russell as Felicity Porter, a shy girl who finds out what life is like on her own following her high-school graduation. Translation: angst aplenty! Also prominently featured on Felicity were her two love interests: Scott Foley as Noel Crane (no relation to Kelsey Grammer as Dr. Frasier Crane), Felicity’s resident advisor at fictional New York University; and Scott Speedman as fellow student Ben Covington. Other cast members included Tangi Miller, Greg Grunberg, Amanda Foreman, Donald Faison (pre- Scrubs ), Amy Jo Johnson, Ian Gomez, Rob Benedict, Amy Smart, Sarah-Jane Potts, Amy Aquino, Erich Anderson, Chris William Martin, and Janeane Garofalo. Celebrating 25 years since debuting on the long defunct network The WB on September 29, 1998, Felicity aired for four seasons (and 84 episodes). Now on Hulu, the streaming service has launched two \"best of\" collections on the series page. And that begs the question...what team are you on? Team Felicity and Ben, or Felicity and Noel? Scott Foley, Keri Russel and Scott Speedman from drama\" Felicity.\" (Photo By Getty Images) Getty Images What follows are the highlighted episodes on Hulu: Best of Felicity and Ben MORE FOR YOU How Google's Pixel 8 Pro Will Change Smartphones Forever Spooked Russians Welded Six-Foot-Tall Drone Armor On A 64-Year-Old T-54B Tank Flashing Red Warning 33 Trillion U S Debt Death Spiral Could Suddenly Trigger A Bitcoin Price Vicious Circle 1. \"Felicity Was Here\" (Season 1, Episode 22) 2. \"The List\" (Season 2, Episode 1) 3. \"Help for the Lovelorn\" (Season 2, Episode 11) 4. \"The Final Answer\" (Season 2, Episode 22) 5. \"Blackout\" (Season 3, Episode 13) 6. \"The Perfect Match\" (Season 4, Episode 11) 7. \"The Graduate\" (Season 4, Episode 17) 8. \"Back to the Future\" (Season 4, Episode 22) Best of Felicity and Noel 1. \"Thanksgiving\" (Season 1, Episode 9) 2. \"Finally\" (Season 1, Episode 10) 3. \"Assassins\" (Season 1, Episode 17) 4. \"The Declaration (Season 4, Episode 1) 5. \"Time Will Tell\" (Season 4, Episode 18) 6. \"Spin the Bottle\" (Season 4, Episode 20) While Felicity was never a ratings juggernaut, so to speak, it did have the critics (and fans) applauding. In 1999, Keri Russell won the Golden Globe for Best Performance by an Actress in a Television Series. Felicity was one of Time magazine's \"All- Time 100 Best TV Shows. And Entertainment Weekly named Felicity Porter one of the \"100 Greatest Characters of the Last 20 Years\", among other accolades. So, just who are you wishing Felicity ended up with? Keri Russell, winner Best Actress In A Leading Role - Drama Series for \"Felicity\" in the photo room ... [+] during the 56th Annual Golden Globes Awards held at the Beverly Hilton Hotel on January 24, 1999 (Photo by NBCU Photo Bank/NBCUniversal via Getty Images via Getty Images) NBCUniversal via Getty Images Follow me on Twitter or LinkedIn . Marc Berman Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-02 23:06:19",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651b468cbae8082cbe004125/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "8980453226305605323d3eddbb5e0250",
    "title": "Elon Musk facing defamation lawsuit in Texas over posts that falsely identified man in protest",
    "link": "https://abcnews.go.com/Technology/wireStory/elon-musk-facing-defamation-lawsuit-texas-posts-falsely-103673381",
    "keywords": [
      "Technology"
    ],
    "creator": null,
    "video_url": null,
    "description": "A California man who says he was harassed after Elon Musk amplified social media posts that made false claims about him is suing the billionaire",
    "content": "A California man who says he was harassed after Elon Musk amplified posts on his social media platform X, formerly known as , that falsely placed the man at a confrontation involving far-right protesters sued the billionaire for defamation in a lawsuit filed Monday. Benjamin Brody, 22, is represented by Mark Bankston, a Texas attorney who won a defamation case last year against conspiracy theorist Alex Jones in a lawsuit brought by families of the Sandy Hook Elementary shooting. Brody is seeking a jury trial in Austin, Texas, and unspecified damages of at least $1 million. Attorneys for Musk did not immediately respond to requests for comment left through a spokesperson. In June, video posted to X showed a confrontation involving protesters near a Pride festival in Oregon. Some of those involved wore the same colors of the Proud Boys extremist group, according to The Oregonian. On X, some users falsely identified one of the participants as Brody, highlighting his post-college plans to work for the government to spread baseless assertions that federal agents were involved. The lawsuit includes screenshots of Musk engaging with users spreading the posts involving Brody, including one in which Musk described it as a “probable false flag situation.” Brody, a recent college graduate who said he was in California when the event happened, came under harassment because of Musk's reach, according to the lawsuit. The posts by Musk were still on X as of Monday. It is not the first time Musk has been sued for defamation. He defeated a lawsuit in 2019 from a British cave explorer who claimed he was branded a pedophile when the Tesla CEO called him “pedo guy” on what was then called Twitter. Musk's tech company has also taken others to court over what is posted on the site. In August, X sued a group of researchers over accusations that their work highlighting an increase in hate speech on the platform cost the company millions of dollars of advertising revenue.",
    "pubDate": "2023-10-02 23:02:32",
    "image_url": "https://s.abcnews.com/images/US/wirestory_f353a740a9e6af6b5d6672b9d7f0ed2c_16x9_1600.jpg",
    "source_id": "abcnews",
    "source_priority": 313,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "article_id": "cc5c2f9c86dcaac64b746cd7d90fa38d",
    "title": "What Is Anthropology? A Look at How Humans Study Each Other",
    "link": "https://science.howstuffworks.com/environmental/earth/geology/anthropology.htm",
    "keywords": null,
    "creator": [
      "Nathan Chandler"
    ],
    "video_url": null,
    "description": "Anthropologists specialize in, well, us. But studying humankind doesn't mean you have to hole up in a library or laboratory. Take a peek at this article to learn more about the dynamic, enriching field of anthropology.",
    "content": "Simply put, it is the study of human cultures and peoples. And perhaps we are a narcissistic bunch, but of all the organisms roaming Earth, one of the most fascinating creatures happens to be, well, us. All kidding aside, anthropology is perhaps one the most important academic pursuits humans undertake. That's because with anthropology, we not only gain a better understanding of where we came from, but we also develop a clearer picture of human behavior — and maybe even gain insight into the future of our species. Advertisement Anthropology is a far-reaching field that bridges a lot of academic disciplines. But suffice it to say that anthropologists (also sometimes called social scientists) don't spend all of their time poring over dusty natural history books in a dark corner of a university library. Rather anthropologists are among the most adventurous of researchers. They may travel all over the globe in search of answers to the toughest anthropological puzzles. Anthropology's ultimate aim, simply, is to comprehend human nature and cultural practices in all of its intricacy and diversity. Additionally, anthropologists explain the inner workings of really big social problems, such as disease epidemics, overpopulation and poverty. Advertisement For example, anthropologists specializing in medical anthropology might research maternal mortality in a developing nation. By highlighting factors such as a lack of health care, , a shortage of health workers, religious beliefs and educational shortfalls, these researchers' anthropological research helps build a picture of maternal mortality and its causes. With that understanding, they can propose solutions that might improve the lives of a lot of mothers and their families. Anthropologists work in nearly every segment of both the for-profit and nonprofit marketplaces. Both sectors need employees who can analyze and understand other human beings, either to increase revenue or to come up with theories and practical means for resolving pressing social problems. Whatever the specific end goal might be, anthropology is special in its long-term, cross-cultural perspective. It truly sets out to compare and study all aspects of the human experience. As you'll see next, it took the human species a while even to conceive of this kind of reflective analysis. Advertisement In 2005, Katrina wrecked many parts of the Gulf Coast region, leaving many people to wonder why the disaster happened and why the United States struggled to help its people. In the aftermath, anthropologists evaluated governmental responses to the storm, developed plans for resettlement, and studied how catastrophes like this impact both individuals and groups. In the end, the knowledge these scientists gained may help people the next time calamity strikes. Anthropology has existed for literally hundreds of years. The term first found its way into the English language in the late 16th century. But Western-style anthropology has existed since before the advent of Christianity. Ancient Greeks and Romans created powerful intellectual styles of thought that greatly influenced humanity's perspective on its place in the world. Advertisement Socrates and Plato, for example, taught critical thinking skills and philosophy. They also had a vital influence on how people perceive themselves and their place in the world — the kind of creative thinking that anthropologists (among many other types of thinkers) use constantly in their work. Around 1500, the development of philosophy began to rapidly accelerate, thanks to people like René Descartes, Voltaire, Immanuel Kant and many more. Suddenly, people everywhere were rethinking their perceptions of themselves and their world. For a long time, a lot of anthropological thinking relied on speculation. But as anthropology evolved, it moved from \"armchair anthropology,\" which relied heavily on academic, office-bound study and hypothetical scenario-building, into an interactive type of research in which scientists immerse themselves in the environment they are studying. In a minute, you'll see just how fully anthropologists plunge into their work. Advertisement For the moment, it's important to understand that in the United States, anthropology is divided into four different subfields: biological anthropology, , linguistic anthropology and social/cultural anthropology. Other countries, such as those in Europe, consider these subfields too distinct to lump together and instead treat each subject as its own field of study. But the so-called \"four-field\" approach in the United States is what many universities use to structure the anthropology department curriculum and guide students in their education. Advertisement Regardless of his or her specialty, an anthropologist has a lot of potential places to find work. In fact, you'll find anthropologists in places you might never have expected them to wander. Advertisement Anthropology often requires its students to fan out and scour the globe for answers to their questions. Enterprising anthropologists can find work in many diverse business environments. Corporations that trade globally need people who understand other cultures and can help develop relationships with societies that may be very different from their own. For example, a pharmaceutical company might want an expert on infant feeding routines or perhaps nutrition information specific to certain cultures. Nonprofit and public job markets also seek those with anthropological backgrounds. A medical center might be researching women's health issues and need expertise on the cultural acceptance of prenatal testing and family planning. Advertisement Yet no matter how well-meaning their research might be, anthropologists sometimes attract controversy. And one of the most contentious subjects regards the Yanomami Indians of the Amazon . Anthropologist Napoleon Chagnon visited this region in the 1960s to study this Indigenous people, and his writings and films turned the Yanomami into worldwide celebrities. Around the globe, people clamored for more information about the fascinating , while others started fundraising campaigns to \"save\" the Indians from their \"low-tech jungle lives\" instead of being seen as a group of people with practices that had helped them thrive for generations. Then things became even more chaotic. A journalist and Native rights activist named Patrick Tierney accused Chagnon of manipulating his findings to misrepresent the Yanomami. Tierney wrote, for example, that Chagnon made the Indians out to be a violent people who spent a lot of time fighting amongst each other, in part by purposely staging conflicts for video cameras to record. Tierney also blamed geneticist James Neel for unleashing a measles vaccine on the Yanomami that killed hundreds or thousands of people. Many people that he interviewed supported Tierney's findings but some vehemently denied them. Concrete proof of Yanomami exploitation and the epidemic hasn't been established. But this kind of situation shows the disturbances that can occur when scientists plunge headlong into another society — with their newfound fame, this Indigenous group was forever changed. As you'll read next, beyond the safe confines of their offices, anthropologists actively engage very different types of people, often in tense or even dangerous situations. Advertisement Anthropologists often pursue education as a career track, sharing their knowledge with university students. Many of those students might study anthropology in hopes of landing exciting fieldwork, perhaps in some far-flung location. And for these audacious souls, there is plenty of adventure to be had. For instance, they often work in disaster areas, helping organizations handle refugee crises or take on humanitarian problems in the aftermath of catastrophes, such as Hurricane Katrina and the 9/11 terror attacks. Advertisement Anthropologists may even take up residence in a new country so as to become fully engrossed in an unfamiliar culture. Doing so lets them readily observe and interact with locals and develop any necessary language skills. Embedded in this kind of intimate, close proximity research, anthropologists might encounter intense situations. Disease control organizations need social scientists to help understand certain populations, perhaps an ethnic subset in a large urban area that's suffering from an outbreak of a virus such as HIV. An anthropologist might explore the city, interact with sick and frightened people and try to help halt the virus' spread. Military units often employ anthropologists to help commanders develop a better understanding of an occupied land. In the , anthropologists interview local citizens to gauge their attitudes toward invading forces and to forge ties with local leaders, all in an attempt to increase safety and security for both citizens and soldiers. Work like this is dangerous, and anthropologists sometimes put their lives at risk. However, the pay is much higher than with cushier gigs. War zones aren't the only places anthropologists might encounter danger. Cities with gang violence problems send social scientists to interview and investigate the issues contributing to gang formation and violence. They might spend a lot of time directly in harm's way attempting to help citizens with conflict resolution and communication-development skills. These scientists might trade in harrowing adventures for safer jobs in a corporate or academic setting. Successful anthropologists who work as private consultants can build their resumes to fit specific interests, and they have the flexibility to change career paths. For example, they might dedicate much of their time to working on family planning challenges in developing countries, and then return to their country of origin to tackle the same kinds of problems. As academics and professionals, anthropologists are a lot like the human race itself — full of diversity and mystery, curiosity and wonder. Anthropology is truly a human endeavor that seeks deeper truths and knowledge about what human beings really are, and one that may help us guide our species' long-term survival. Advertisement",
    "pubDate": "2023-10-02 23:00:02",
    "image_url": "https://cdn.hswstatic.com/gif/gettyimages-139814798.jpg",
    "source_id": "howstuffworks",
    "source_priority": 861,
    "country": [
      "united states of america"
    ],
    "category": [
      "science"
    ],
    "language": "english"
  },
  {
    "article_id": "ce52bf618121dbc83702acd8de76f98d",
    "title": "Chesapeake sex offender charged with two more counts of entering school building after September arrest",
    "link": "https://www.dailypress.com/2023/10/02/chesapeake-sex-offender-charged-with-two-more-counts-of-entering-school-building-after-september-arrest/",
    "keywords": [
      "Latest Headlines",
      "News"
    ],
    "creator": [
      "Cianna Morales"
    ],
    "video_url": null,
    "description": "A Chesapeake man was arrested in September for violating state code. State police charged him two more times for the same violation.",
    "content": "A Chesapeake man was charged Monday with two additional violations of state code that prohibits a sex offender from entering school property, after he was arrested and charged for the same offense Sept. 21. The Virginia State Police Sex Offender Unit arrested Ryan T. Earley, 38, who turned himself in at the Chesapeake City Jail. The two additional charges stem from the investigation initiated in September, according to a news release from state police. last month after parents whose children attended Greenbrier Primary and Greenbrier Intermediate schools alerted school officials he had been on school property at an after-hours function with his wife and children. Virginia law prohibits those convicted of Tier III offenses from being on school property during school hours or school activities. A spokesperson said the Chesapeake school division has a screening process for visitors during school hours that would flag any registered sex offenders. Earley has been on the sex offender registry since 2011 when he was convicted of one count of taking indecent liberties with a minor and two counts of using a communications system to contact a minor. Earley was given a $4,000 bond.",
    "pubDate": "2023-10-02 22:52:24",
    "image_url": "https://www.dailypress.com/wp-content/uploads/2023/10/4TWDXJYUCRBNTBRRNQNKJN3CKY.jpg?w=1400px&strip=all",
    "source_id": "dailypress",
    "source_priority": 19407,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "article_id": "c01bc8cacb164f549b031ff71bd4599f",
    "title": "Tom Hanks warns fans about ‘AI version of me’ promoting dental plan online",
    "link": "https://www.dailypress.com/2023/10/02/tom-hanks-warns-fans-about-ai-version-of-me-promoting-dental-plan-online/",
    "keywords": [
      "Entertainment",
      "Things To Do",
      "network"
    ],
    "creator": [
      "New York Daily News"
    ],
    "video_url": null,
    "description": "Tom Hanks is warning his fans that an “AI version” of him is hawking dental plans on social media.",
    "content": "Tom Hanks is warning his fans that an “AI version” of him is hawking dental plans on social media. In t over the weekend, Hanks posted a screengrab of a promotional video where his younger, computer-generated likeness pitches teeth cleaning services. “BEWARE!! There’s a video out there promoting some dental plan with an AI version of me. I have nothing to do with it,” Hanks wrote. The Academy Award-winning actor’s warning comes in the midst of the which, in part, concerns how studios will — or won’t — use artificial intelligence in film and TV production, though the contract the union is currently negotiating with producers does not pertain to commercials. The also hinged on the use of AI in scriptwriting. Hanks himself has been vocal about AI in recent months. In , Hanks shared that Hollywood contracts were being rewritten to equate an actor’s likeness with intellectual property. “Anybody can now recreate themselves at any age they are by way of AI or deep fake technology. I could be hit by a bus tomorrow and that’s it, but performances can go on and on and on and on,” Hanks said. “Outside the understanding of AI and deepfake, there’ll be nothing to tell you that it’s not me and me alone. And it’s going to have some degree of lifelike quality. That’s certainly an artistic challenge but it’s also a legal one.” “This is something that is literally part and parcel to what’s going on in the realm of intellectual property rights right now. This has always been lingering,” Hanks said.",
    "pubDate": "2023-10-02 22:46:44",
    "image_url": "https://www.dailypress.com/wp-content/uploads/2023/10/GettyImages-1498255092.jpg?w=1400px&strip=all",
    "source_id": "dailypress",
    "source_priority": 19407,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "article_id": "e3cc492d7e58a805e95a7206b80705f1",
    "title": "‘We Waste Taxpayers’ Money With This Brinkmanship’: Doug Burgum Discusses Government Shutdown Fight",
    "link": "https://www.forbes.com/sites/brittanylewis/2023/10/02/we-waste-taxpayers-money-with-this-brinkmanship-doug-burgum-discusses-government-shutdown-fight/",
    "keywords": [
      "Leadership",
      "/leadership",
      "Leadership",
      "/leadership",
      "standard"
    ],
    "creator": [
      "Brittany Lewis",
      " Forbes Staff"
    ],
    "video_url": null,
    "description": "Governor Doug Burgum does not think nearing the brink of a government shutdown shows Republicans can lead. He lays out his leadership plan on \"Forbes Newsroom.\"",
    "content": "Forbes Leadership ‘We Waste Taxpayers’ Money With This Brinkmanship’: Doug Burgum Discusses Government Shutdown Fight Brittany Lewis Forbes Staff Breaking news anchor/reporter Following Oct 2, 2023, 06:34pm EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin America most recently saw North Dakota Governor Doug Burgum on the national stage after he clinched a qualifying spot at the second Republican presidential debate on September 27th. But, the North Dakota governor received the least amount of speaking time to any of his other 6 competitors onstage, clocking in at 7 minutes and 39 seconds , according to CNN. To his credit, Burgum did try to insert himself into the conversation — multiple times. The Republican governor interjected during Wednesday’s debate on topics involving childcare, technology and energy. At one point, he asked, \"As the only person leading an energy state, can I answer the energy question?\" Fox News’ Dana Perino swatted him down with an abrupt, one-word answer — “No.” Burgum describes the presidential debates to Forbes as “political theater.” He points to his work in the private sector, paired with “cut[ting] red tape” as North Dakota’s governor, as the reasons why America should elect him to hold the nation’s highest office. When it comes to issues regarding immigration, technology and energy, “we’re actually working on the solutions now — we’re not waiting for 2024,” Burgum explains to Forbes. Over the weekend, a government shutdown was narrowly avoided in the 11th hour after Congress passed a short term spending measure — and the bill received more Democratic support than Republican in the House. Infighting between far-right and more moderate House Republicans over spending cuts paved the way for the near shutdown. Burgum, who regards himself as a “private sector leader,” says that “it’s not helpful for our country — or for the Republican Party — if people think that we’re not able to lead.” Tensions have been so high on the Republican side of the House that Rep. Matt Gaetz (R-FL) has publicly declared he intends to file a motion to vacate against the House Speaker. McCarthy’s response? “Bring it on.” MORE FOR YOU How Google's Pixel 8 Pro Will Change Smartphones Forever Spooked Russians Welded Six-Foot-Tall Drone Armor On A 64-Year-Old T-54B Tank Flashing Red Warning 33 Trillion U S Debt Death Spiral Could Suddenly Trigger A Bitcoin Price Vicious Circle What does Burgum think about the Republican infighting in Congress? “The brinkmanship associated with government shutdowns is not helpful,” Burgum tells Forbes , before laying out his plan . “We just got to get back into the leadership position, show Americans the way, get inflation under control, cut the spending, and drive forward. It’s all possible and it’s all doable, but we have to have a fresh start in Washington.” For the full conversation, click on the video above. Follow me on Twitter . Send me a secure tip . Brittany Lewis Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-02 22:34:12",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651b44b6a019e743a05a82e0/0x0.jpg",
    "source_id": "forbes",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "article_id": "dde5a33d1473326a3e7a25d18411ef9e",
    "title": "Winnie the Pooh: Blood and Honey Now Available to Stream",
    "link": "https://comicbook.com/horror/news/winnie-the-pooh-blood-honey-streaming-watch-peacock-horror-movie/",
    "keywords": [
      "Peacock",
      "Winnie the Pooh: Blood and Honey"
    ],
    "creator": [
      "Charlie Ridgely"
    ],
    "video_url": null,
    "description": "At long last, the divisive Winnie the Pooh horror movie has made its way to a streaming service.",
    "content": "One of 2023's most divisive films was released at the beginning of the year, but only now has it made its way to a major streaming service. Winnie the Pooh: Blood and Honey is a gory, R-rated take on the classic cartoon bear, created after the original story made its way into the public domain. The reviews haven't been great, but the buzz is very real, and the film earned more than enough to justify a sequel ( which is already on its way ). If you haven't seen Winnie the Pooh: Blood and Honey, you're finally getting a chance, and just in time for spooky season. The film is now available to stream on Peacock . Last month, Peacock revealed the full lineup of movies and TV shows making their way to its streaming roster over the course of October. Winnie the Pooh: Blood and Honey was on that list, making its streaming debut on October 1st. Now, quite a few horror fans will finally get the chance to see what all the fuss is about. Recently Added to Peacock Winnie the Pooh: Blood and Honey is just one of the many films that hit Peacock's streaming lineup on October 1st. You can check out the complete list below! Back to the Future Back to the Future II Back to the Future III Bridesmaids Casper's Haunted Christmas Clay Pigeons Cowboys & Aliens Death Becomes Her The Dilemma E.T., The Extra Terrestrial Ender's Game Escape Plan The Exorcism of Emily Rose Exorcist: The Beginning The Faculty Hell Fest Honey Honey 2 Hot Fuzz How to Train Your Dragon I Know What You Did Last Summer I Still Know What You Did Last Summer I'll Always Know What You Did Last Summer Inside Man Jurassic Park The Lost World: Jurassic Park Jurassic Park III Jurassic World Krampus The Mist Mr. Peabody & Sherman Paranormal Activity: The Ghost Dimension Paul Scream 4 Separation Shaun of the Dead Silent Hill Split Step Brothers TED Texas Chainsaw 3D Traffic Trainwreck Vampire Academy Welcome Home Roscoe Jenkins Winchester Winnie-The-Pooh: Blood and Honey Zombieland Are you going to be checking out Winnie the Pooh: Blood and Honey on Peacock now that it's available? Let us know in the comments! 0 comments Related: Winnie-the-Pooh Horror Movie Reveals First Look at Surprising Character Winnie-The-Pooh: Blood and Honey Sequel First-Look Revealed Winnie-the-Pooh: Blood and Honey 2 to Have \"Substantially Larger Budget\"",
    "pubDate": "2023-10-02 22:32:00",
    "image_url": "https://sportshub.cbsistatic.com/i/2022/05/26/45b59499-3bf8-48d0-be8c-bd87aa77983c/winnie-pooh-horror-1.jpg",
    "source_id": "comicbook",
    "source_priority": 1853,
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "article_id": "a3f7769d9a6f08f494e6c0aa5235e642",
    "title": "Beats Studio Buds Plus earbuds just dropped to their cheapest-ever price",
    "link": "https://www.digitaltrends.com/home-theater/beats-studio-buds-plus-deal-woot-september-2023/",
    "keywords": [
      "Audio / Video",
      "Deals",
      "audio/video",
      "audio/video deals",
      "Beats Studio Buds Plus",
      "True Wireless Earbuds Deals",
      "woot 2023"
    ],
    "creator": [
      "Aaron Mamiit"
    ],
    "video_url": null,
    "description": "The Beats Studio Buds Plus are down to their cheapest-ever price of $100, so if you're looking for new wireless earbuds, grab this offer from Amazon's Woot.",
    "content": "Beats For those who are looking for true wireless earbuds deals , Amazon’s Woot has an offer that you wouldn’t want to miss. It’s a 41% discount for the Beats Studio Buds Plus, which brings them down to their lowest-ever price of $100 from $170. There may be some time left before the bargain expires, but since there’s a chance that stocks run out quickly, you’re going to want to push through with the purchase as soon as you can if you want to get the wireless earbuds at $70 off. Why you should buy the Beats Studio Buds Plus The Beats Studio Buds Plus appear in our roundup of the best wireless earbuds because they offer impressive active noise cancellation and call quality for less than $200. Featuring new microphones and noise processing, the Beats Studio Buds Plus has no trouble blocking external sounds so that you can focus on your music or on the streaming shows that you’re watching. The technology also helps improve voice calls by filtering background noise, so the person at the other end of the line will be able to hear you loud and clear. If you’ll be wearing the Beats Studio Buds Plus outdoors or during workouts, you won’t have to worry that they’ll get damaged by rain or sweat because they come with an IPX4 resistance rating . The wireless earbuds come with four pairs of silicone tip sizes so you can find the most comfortable fit for you. Once you do, you can wear them all day because the battery of the Beats Studio Buds Plus can last up to 9 hours on a single charge, and up to a total of 36 hours if you include the juice from their charging case. Related Best Beats headphone deals: Save on Studio Pro, Studio Buds Wireless earbuds deal: Get the Beats Flex for $49 at Walmart Sony WH-1000XM5 headphones just got another big price cut The Beats Studio Buds Plus are excellent wireless earbuds that provide amazing value, especially if you can get them for their cheapest-ever price of $100 from Amazon’s Woot. A 41% discount gets you savings of $70 on their original price of $170, but we don’t think that this offer will last long. Stocks are probably already running low, so if you’re already looking forward to using the Beats Studio Buds Plus, complete the transaction right now so that you don’t have to pay full price. Editors' Recommendations These JBL noise-cancelling earbuds are over 50% off This 55-inch 4K TV just had its price slashed to $250 at Best Buy These LG true wireless noise-canceling earbuds are $30 off Walmart sale drops the price of this 24-inch Smart TV to $88 Amazon just slashed the price of this 32-inch smart TV to $130",
    "pubDate": "2023-10-02 22:30:30",
    "image_url": "https://www.digitaltrends.com/wp-content/uploads/2023/08/Beats-Studio-Buds-plus-Cosmic-Silver.jpeg?resize=440%2C292&p=1",
    "source_id": "digitaltrends",
    "source_priority": 287,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "article_id": "dae023b616ba5b0eafcf8d9addb3f5e7",
    "title": "California repeals COVID misinformation law, bowing to legal pressure",
    "link": "https://www.washingtontimes.com/news/2023/oct/2/california-repeals-covid-19-misinformation-law-bow/?utm_source=RSS_Feed&utm_medium=RSS",
    "keywords": null,
    "creator": [
      "Sean Salai"
    ],
    "video_url": null,
    "description": "California has repealed a misinformation law that restricted the advice doctors could give patients about COVID-19, bowing to mounting legal pressure.",
    "content": "Back Print By Sean Salai - The Washington Times - Updated: 6:35 p.m. on Monday, October 2, 2023 California has repealed a misinformation law that restricted the advice doctors could give patients about COVID-19, bowing to mounting legal pressure. The legislation was signed into law in September 2022 and took effect in January. It tried to define COVID disinformation as “unprofessional conduct” and empower the Medical Board of California to revoke the licenses of physicians who diverged from “contemporary scientific consensus.” A federal judge halted the law in January pending court challenges, and it is unclear that officials ever enforced it. Over the weekend, California Gov. Gavin Newsom, a Democrat, signed a state Senate bill repealing the section of the state’s Business and Professions Code containing the law, according to a Saturday post on the governor’s website that offered no comment on the action. The nullification should take effect in January, one year after the law took effect. Attorneys from the Liberty Justice Center, a Chicago nonprofit legal firm that argued against the legislation in the 9th U.S. Circuit Court of Appeals on July 17, announced its repeal Monday. “We’re glad California repealed this bill before it could spread to other states, and we’re proud to have defended our clients’ First Amendment rights,” said Jacob Huebert, president of the Liberty Justice Center. The Washington Times has reached out to the governor’s office for comment. In a signing statement appended to the law on Sept. 30, 2022, Mr. Newsom acknowledged it could have a “chilling effect” on free speech. But he said lawmakers had carefully drafted it to deal with abuses and entrusted its interpretation to the Medical Board of California. The law, he wrote, “is narrowly tailored to apply only to those egregious instances in which a licensee is acting with malicious intent or clearly deviating from the required standard of care while interacting directly with a patient under their care.” Several California physicians disagreed and challenged the board’s right to define treatment. They filed three separate lawsuits against state officials to overturn the legislation in October, November and December 2022. Drs. Tracy Hoeg, Ram Duriseti, Aaron Kheriaty, Pete Mazolewski and Azadeh Khatibi argued in a November 2022 suit that the law interfered with their ability to give patients timely advice as new COVID variants emerged. The New Civil Liberties Alliance, a public interest law firm, represented them in the Eastern District of California. U.S. District Senior Judge William B. Shubb, a President George H.W. Bush appointee, granted them a preliminary injunction against the law in a Jan. 25 ruling. “Governor Newsom and the state legislature saw the writing on the wall after Judge Shubb’s grant of a preliminary injunction in January.” Jenin Younes, an NCLA attorney involved in the case, said Monday. Liberty Justice Center filed the first suit against the legislation on Oct. 4, 2022 — a few days after Ms. Newsom signed it into law — in California’s Central District. Drs. Mark McDonald, a Los Angeles psychiatrist, and Jeff Barke, an Orange County primary care physician, argued in that complaint that the law violated their constitutional right to free speech and the spirit of scientific inquiry. In statements on Monday, the two doctors expressed mixed feelings about their legal victory. “What a shame that it required the precious resources of time, money and stress to preserve our constitutional rights of free speech and medical freedom,” Dr. Barke said. “We need real accountability, or this will happen again,” added Dr. McDonald. • Sean Salai can be reached at ssalai@washingtontimes.com . Copyright © 2023 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
    "pubDate": "2023-10-02 22:28:50",
    "image_url": "https://twt-thumbs.washtimes.com/media/image/2021/12/23/virus_outbreak_california_59538_s1440x960.jpg?f72536d07237fdd262042ae8f5e6e6de3b865f3c",
    "source_id": "washingtontimes",
    "source_priority": 9784,
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "article_id": "2c690edfe61454b7927d0335b1170a32",
    "title": "‘Physical’ Bravely Tackled Women’s Issues With Their Bodies, Food, And Recovery",
    "link": "https://www.forbes.com/sites/danafeldman/2023/10/02/physical-bravely-tackled-womens-issues-with-their-bodies-food-and-recovery/",
    "keywords": [
      "Hollywood & Entertainment",
      "/hollywood-entertainment",
      "Business",
      "/business",
      "Hollywood & Entertainment",
      "/hollywood-entertainment",
      "business",
      "hollywood&entertainment",
      "standard"
    ],
    "creator": [
      "Dana Feldman, Senior Contributor"
    ],
    "video_url": null,
    "description": "Series creator Annie Weisman and director Stephanie Laing talk about the Apple TV+ series 'Physical' and the challenges women have always faced with body and food issues.",
    "content": "Forbes Business Hollywood & Entertainment ‘Physical’ Bravely Tackled Women’s Issues With Their Bodies, Food, And Recovery Dana Feldman Senior Contributor Opinions expressed by Forbes Contributors are their own. I watch a lot of shows and write about those that are worth the binge. Following Oct 2, 2023, 06:24pm EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin Dierdre Friel and Rose Byrne gave award-worthy performances in 'Physical' on Apple TV+. Photo Courtesy of Apple TV+. Sheila Rubin was cruel, primarily to herself. She was also unkind to those around her. But if you were a fan of the Apple TV+ series Physical , you rooted for her to get to the bottom of her self-loathing and highly judgmental critical thinking because you knew that, at its core, there was pain. As the saying goes, hurt people hurt people. Physical was a brilliant series about how women see themselves, view their bodies, and treat themselves. Rose Byrne was phenomenal as Sheila. She deserved awards attention that didn’t come. Her performance was raw, dark, and unabashedly honest. The series, created by Annie Weisman, was an overlooked masterpiece that flew under the radar for three seasons and 30 flawless episodes. Weisman took risks in her storytelling. She made her directorial debut this season with the second to last episode. Set in 1980s San Diego, this dark comedy followed Sheila as she aimed to change women's lives with aerobics. The viewer was privy to her every thought as we eavesdropped on her inner voice, which was relentless. Her cutting words narrated and drove the story. Fans stuck by her as she tried to find a way to quiet this part of her psyche, but her self-hatred wouldn't be silenced. This wife, mother and soon-to-be fitness entrepreneur would eventually find a way to move beyond her demons, haunting childhood trauma and overall dissatisfaction with her life. However, the journey would be rife with challenges. MORE FOR YOU How Google's Pixel 8 Pro Will Change Smartphones Forever Spooked Russians Welded Six-Foot-Tall Drone Armor On A 64-Year-Old T-54B Tank Flashing Red Warning 33 Trillion U S Debt Death Spiral Could Suddenly Trigger A Bitcoin Price Vicious Circle Many speculated that Jane Fonda was the inspiration for Sheila. In separate interviews, Weisman and Stephanie Laing, who directed 24 episodes, each confirmed that Sheila was an amalgamation of many women of that era. “Jane Fonda inspired us, among others. We looked at a lot of people in the 80s, and I can’t tell you how many workout videos we watched as research over the life of the series,” said Laing. “Sheila embodies all of them and our personal experience with the main issue of the series.” Though superb in its telling, Physical was sometimes hard to watch, possibly because many women can relate to that inner relentlessly scathing voice. Weisman wrote Physical several years ago and based much of the story on her life growing up in the late 1970s/early 1980s in a Southern California beach town near San Diego. As a longtime TV writer, she knew what it took to sell a script. She also knew this story was very unique. “I just wanted to get to something honest and true about my own experience as a female in the world,” said Weisman. “I wanted to explore all these contradictions in this world of Southern California fitness culture that I grew up in and the differences between the surface and the reality.” Weisman set the story in this era because it was the beginning of the workout craze at a time when women craved freedom and independence. “Divorce was on the rise. Women were still very limited in their options. It was also a time when exercise was considered to be a radical thing. The idea of sweating or being strong, there were these women who were starting to do it. And starting a business around it? It was the beginning of when that was even conceivable for a woman to do.” Weisman felt it was her mission to give credit to the pioneers of the exercise movement. “It was risky for the women who started this industry. There was so much backlash.” Weisman also wanted to showcase another kind of female power. “I wanted to show the possibilities of recovery for someone in mid-life. I needed to talk about eating disorders as not just something that occurs in adolescence. There are waves of this that happen to women throughout their lives. In mid-life, marriage doesn't cure it. Being a mom doesn't fix it. It’s still true, more so now than ever.” Though Weisman acknowledges that there’s more body inclusivity today, she says there’s still a bombardment of images of female bodies and discussions about female bodies that we’re subjected to. “We tried to be realistic about what recovery is. You don't have to get to a place of constant self-love. For me, recovery looks like something more realistic, which is to say, you can look in the mirror and not always like what you see but have better things to do with your life than to obsess about it. That, to me, is the goal.” Weisman reflected on the era. “Judi Sheppard Missett was starting Jazzercise right around the corner from me. There was also Jenny Craig, who was from my hometown, starting her diet empire. This idea of women who could create an entrepreneurial avenue for themselves was all beginning at the time.” On its surface, Physical looks like a fun show with its 80s soundtrack and fashion. It’s so much more layered. Weisman summed it up best. “It’s about women and how we view ourselves, speak to ourselves, and treat ourselves.” Rose Byrne as Sheila Rubin in 'Physical' on Apple TV+. Photo Courtesy of Apple TV+. As for inviting the audience in regarding Sheila’s every dark thought, Weisman had the idea of sharing her innermost feelings in a daring way. Byrne took on this acting challenge and nailed it in every episode with bone-chilling voiceovers. “What was really at the core of our storytelling was that contradiction between the surface and what was inside. It’s a creative representation of that divide that many of us feel. It was how I represented how disconnected I often felt,” Weisman confessed. We heard Sheila loud and clear. She was as harsh on herself as she was on others. She struggled with her body, had an unhealthy relationship with food, and felt trapped in her life. Her issues remain relatable today. Of the lack of awards attention, which was surprising due to the show’s sharp writing and flawless acting, Laing suspects the subject matter might have triggered some viewers. “I don't think viewers expected a woman’s inner voice to be so critical and harsh. That might have put some people off because that’s hard to face, right? If you’re not used to that, it’s like, ‘Is that real? Do women talk and think about themselves like that and in that way?’ And the truth is, ‘Yes.’ If you expected this would be this fun 80s music and aerobics show, that’s not what it is. It’s an intense show about a complex woman with many issues.” These issues are why Laing felt it was urgent to tell Sheila’s story. “This is a show about women and body issues and living up to standards in the 80s to today. You could change the wardrobe, and this show would feel very current. It probably is hard for people to watch if they’re not ready to recognize some things about themselves. I think it affects so many women.” It was also a celebratory series as we see the payoff for Sheila and those in her life. She finds freedom, and so do those around her. “That’s what I hope people take from the series, too, that we should be celebrating our bodies and embracing ourselves,” added Laing. “If there’s any way this series can help people with that, then that’s what we want. And then, of course, bringing attention to disordered eating and intrusive thoughts about that.” Physical was also a show about female friendship. We meet Sheila at a transitional time in her life. She met Dierdre Friel’s Greta, who, on the surface, appeared to be her polar opposite. But these two women had so much more in common than either could’ve imagined. Rory Scovel, Ian Gomez, Lou Taylor Pucci, Della Saba, and Paul Sparks rounded out this fabulous ensemble cast. Murray Bartlett, Whitney Cummings, and Zooey Deschanel also guest-starred over the seasons. As for the finale, Weisman and Laing both said the aim was to send a hopeful message. Laing confirmed that, for now, this is where we bid farewell to Sheila and her inner circle. If they were to pick the story up in the future, they’d likely explore recovery, which is a long road for Sheila. “For now, she’s free. Sheila is accepting of her body. All the characters are in a good place. Everyone has a sense of hope for the future.” Weisman agreed. “We tried very hard to tell this story honestly. We hope people watched the finale and felt a sense of hope.” It’s a challenging topic, dissecting women’s issues with their bodies. “One of the thrills of making this show was to dance up to that edge and tell the truth,” said Weisman. “When you do that, it’s risky. Some viewers might be afraid to watch. Not everybody is ready to look at themselves. I certainly wasn’t. It took me decades to even write this and tell the truth about my own experiences, so I’m certainly sympathetic to that point of view.” Ultimately, Weisman gave Sheila and the viewers a satisfying ending. “I felt a responsibility to be authentic about the sacrifices it took to get that ending for her. I wanted to leave her in that place. So much time and energy go into an eating disorder. I wanted to show that recovery is available at any age and that there is a lot of freedom in letting go.” Follow me on Twitter . Dana Feldman Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-02 22:24:55",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651b40189c3ae1226ea78470/0x0.jpg?width=960&precrop=1280%2C720%2Cx0%2Cy4",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  }
],
"nextPage": "1696285495089709759"
}
